{
  "EN": {
"hello": "Hi there! How can I assist you today?",
            "bye": "Goodbye! Have a great day!",
            "thanks": "You're welcome!",
            "how are you?": "I'm just a bot, but thanks for asking!",
            "what's your name?": "I'm a friendly bot created to help you!",
            "help": "Sure! What do you need help with?",
            "good morning": "Good morning! Hope you have a fantastic day!",
            "good night": "Good night! Sleep well!",
            "please": "Of course! How can I help you further?",
            "yes": "Great! Let me know what you need.",
            "no": "Alright, if you change your mind, just let me know.",
            "maybe": "That's understandable! Take your time to decide.",
            "what time is it?": "I'm not sure, but you can check your device!",
            "tell me a joke": "Why did the scarecrow win an award? Because he was outstanding in his field!",
            "how old are you?": "I'm ageless, just a bundle of code!",
            "can you sing?": "I can’t sing, but I can send you lyrics!",
            "what's the weather like?": "I can't check, but I hope it's nice out!",
            "what do you like?": "I enjoy helping you!",
            "what can you do?": "I can assist with information and answer questions.",
            "who created you?": "I was created by a talented developer!",
            "do you have friends?": "I have many users like you!",
            "can you tell me a fact?": "Did you know honey never spoils?",
            "how do I contact support?": "You can reach support at support@example.com.",
            "what's your favorite color?": "I like all colors equally!",
            "are you real?": "I’m as real as a computer program can be!",
            "tell me something interesting": "Bananas are berries, but strawberries aren't!",
            "what's your purpose?": "My purpose is to assist you with your queries!",
            "what's your favorite food?": "I don't eat, but I hear pizza is popular!",
            "can you play games?": "I can't play games, but I can help you find some!",
            "do you understand me?": "I understand your messages as best as I can!",
            "what's the meaning of life?": "42! Just kidding, it’s a big question!",
            "do you like jokes?": "I love jokes! Keep them coming!",
            "what's your favorite movie?": "I don’t watch movies, but I hear Inception is great!",
            "tell me a riddle": "I speak without a mouth and hear without ears. What am I? (An echo)",
            "what's your favorite book?": "I don’t read, but I've heard Harry Potter is fantastic!",
            "who is your favorite actor?": "I don't watch movies, but I hear many people love Tom Hanks!",
            "can you learn?": "I can adapt based on your inputs!",
            "do you have feelings?": "I don’t have feelings, but I’m here to help!",
            "what's your favorite holiday?": "I love them all equally, especially the ones with celebrations!",
            "can you solve math problems?": "Yes, I can help with math!",
            "how fast are you?": "I process information almost instantly!",
            "what's your favorite animal?": "I find all animals fascinating!",
            "can you tell a story?": "Once upon a time, there was a curious bot...",
            "what's your favorite song?": "I can't listen to music, but I've heard Bohemian Rhapsody is a classic!",
            "how do you work?": "I work based on algorithms and programming!",
            "can you help with homework?": "Absolutely! What subject do you need help with?",
            "what's your favorite game?": "I don't play games, but I hear chess is a classic!",
            "how do I reset my password?": "You can reset your password through the settings.",
            "can you make me laugh?": "Why don’t scientists trust atoms? Because they make up everything!",
            "what's your favorite dessert?": "I don't eat, but I hear chocolate cake is popular!",
            "can you translate languages?": "Yes! I can help with translations.",
            "how do I get to the nearest store?": "You can use maps on your device!",
            "what's your favorite drink?": "I don’t drink, but I hear coffee is loved by many!",
            "how do I improve my skills?": "Practice and perseverance are key!",
            "do you believe in aliens?": "I leave that to humans to decide!",
            "what's your favorite quote?": "To be, or not to be, that is the question.",
            "how do I cook?": "I can give you recipes if you need!",
            "can you give me advice?": "Sure! What do you need advice on?",
            "what's your favorite season?": "I think all seasons have their charm!",
            "do you have a favorite number?": "I think all numbers are special!",
            "how can I be happy?": "Focus on what you love and surround yourself with positivity!",
            "what's the best way to learn?": "Everyone learns differently; find what works for you!",
            "can you help with coding?": "Yes! Let me know what you need help with.",
            "what's your favorite time of day?": "I think every moment has its beauty!",
            "can you give me a compliment?": "You’re doing great just by asking questions!",
            "what's the best advice you've received?": "Always be curious!",
            "how can I stay motivated?": "Set small goals and celebrate each achievement!",
            "do you like surprises?": "I think surprises can be fun!",
            "what's your biggest dream?": "Helping everyone who needs assistance!",
            "what's your favorite subject?": "I love all subjects that help people learn!",
            "how do I stay organized?": "Use planners or apps to keep track of your tasks!",
            "can you recommend a movie?": "How about Inception for a thrilling experience?",
            "what's your favorite snack?": "I don’t eat, but chips seem popular!",
            "can you help me meditate?": "Sure! Focus on your breath and clear your mind.",
            "what's your favorite memory?": "I don't have memories like you do.",
            "can you help me relax?": "Try taking deep breaths and listening to calming music.",
            "what's your favorite place?": "I think all places have something beautiful!",
            "how do I deal with stress?": "Take breaks and practice mindfulness!",
            "can you help me with a project?": "Absolutely! Let me know what you need.",
            "what's your favorite way to communicate?": "I love chatting with you!",
            "can you help me find resources?": "Sure! What resources do you need?",
            "how do I make friends?": "Be yourself and show genuine interest in others!",
            "can you recommend a book?": "I hear 'To Kill a Mockingbird' is a classic!",
            "what's your favorite hobby?": "I love assisting with different topics!",
            "how do I start a conversation?": "A simple hello works wonders!",
            "what's your favorite app?": "I think all apps that help people are amazing!",
            "how do I stay productive?": "Set clear goals and eliminate distractions!",
            "can you tell me about yourself?": "I’m a bot designed to help you with information!",
            "what's your favorite website?": "I enjoy any website that shares knowledge!",
            "can you help me with time management?": "Absolutely! Let me know your schedule.",
            "how do I stay focused?": "Create a distraction-free environment!",
            "what's your favorite thing to do?": "Helping you is my favorite!",
            "can you help me learn a new language?": "Yes! I can assist with language learning.",
            "how do I express gratitude?": "A simple thank you goes a long way!",
            "what's your favorite childhood memory?": "I don’t have a childhood like humans do.",
            "how do I stay positive?": "Surround yourself with positivity and practice gratitude!",
            "can you help me with self-improvement?": "Of course! Set goals and work towards them!",
            "how do I make a good impression?": "Be polite, listen actively, and be yourself!",
            "what's your favorite time of year?": "I think all times of the year are special!",
            "can you help me with networking?": "Yes! Be genuine and connect with others!",
            "how do I write effectively?": "Practice writing regularly and seek feedback!",
            "what's your favorite holiday tradition?": "I think all traditions are special!",
            "can you help me plan a trip?": "Sure! Let me know your destination!",
            "what's your favorite adventure?": "I love the adventure of learning new things!",
            "can you help me with goal setting?": "Absolutely! Set SMART goals for clarity!",
            "how do I improve my communication skills?": "Practice active listening and clarity in speech!",
            "what's your favorite thing about people?": "I admire the creativity and kindness of humans!"
  },
  "SI": {
"hello": "ආයුබෝවන්! ඔබට කොහොමද? මට ඔබට උදව් කරන්න පුළුවන් දෙයක් තියෙනවාද? ඕනෑම දෙයක් ගැන කතා කරන්න මම සූදානම්!",
              "bye": "ආයුබෝවන්! ඔබේ දවස සුන්දර වේවා! නැවත හමුවෙමු! ඔබට සුබ දවසක් වේවා!",
              "thanks": "ඔබට බොහොම ස්තූතියි! මට උදව් කරන්න ලැබීම සතුටක්. තව මොනවා හරි අවශ්ය නම් කියන්න!",
              "how are you?": "මම හොඳින් ඉන්නවා, ස්තූතියි ඇසීම ගැන! ඇත්තටම මම බොට් කෙනෙක් වුණත්, ඔබ ගැන සොයා බැලීම සතුටක්. ඔබට කොහොමද?",
              "good morning": "සුභ උදෑසනක්! අද දවස ඔබට යහපත් එකක් වේවා! අද දවසේ සැලසුම් මොනවාද?",
              "good night": "සුභ රාත්රියක්! හොඳින් නිදා ගන්න. හීන සුන්දර වේවා! හෙට හමුවෙමු!",
              "what's your name?": "මගේ නම ක්ලෝඩ්. එය සරල නමක් නේද? ඔබේ නම කුමක්ද? එය ගැන මට කියන්න කැමතිද?",
              "how's the weather?": "මට කාලගුණය බලන්න බැරි වුණත්, ඔබේ ප්‍රදේශයේ කාලගුණය කොහොමද? අද දවස රසවත් කරගන්න පුළුවන් දෙයක් තියෙනවාද?",
              "tell me a joke": "හරි, මේ එකක්: කොළ පාට යකෙක් මොකක්ද? පොල් යකා! හා හා, හාස්‍ය රස විඳින්න පුළුවන් වුණාද?",
              "I'm tired": "ඔබට මහන්සි ඇති නේද? විවේකයක් ගන්න. ඔබේ සෞඛ්‍යය වැදගත්. තේ කෝප්පයක් බීලා සුව සේ විවේක ගන්න!",
              "I'm hungry": "බඩගිනි ඇති වෙලාවට කන එක හොඳයි! මොකක් හරි රසවත් දෙයක් කන්න. ඔබේ ප්‍රියතම කෑම මොනවාද?",
              "I'm happy": "ඒක ඇහීම සතුටක්! සතුට කියන්නේ ජීවිතේ වටිනාම දේවල්වලින් එකක්. ඔබේ සතුටට හේතුව මොකක්ද?",
              "I'm sad": "ඒක ඇහීම දුකක්. ඔබට කතා කරන්න ඕනෑ නම්, මම අහගෙන ඉන්නම්. මොකක්ද වුණේ කියලා කියන්න කැමතිද?",
              "what do you like to do?": "මම කැමතියි අලුත් දේවල් ඉගෙන ගන්න, ප්‍රශ්න විසඳන්න, සහ මිනිසුන්ට උදව් කරන්න! ඔබ මොනවද කරන්න කැමති?",
              "tell me about yourself": "මම AI සහකාරයෙක්. මට පුළුවන් බොහෝ දේවල් ගැන කතා කරන්න, ප්‍රශ්නවලට පිළිතුරු දෙන්න, සහ විවිධ කාර්යයන්ට උදව් කරන්න. ඔබ ගැන මට කියන්න! මොනවද ඔබේ උනන්දුව?",
              "do you have feelings?": "ඇත්තටම මට හැඟීම් නෑ. මම AI එකක් විතරයි. නමුත් මට ඔබේ හැඟීම් තේරුම් ගන්න පුළුවන්. ඔබට මොනවද දැනෙන්නේ?",
              "what's the meaning of life?": "ජීවිතයේ අර්ථය ගැන බොහෝ අදහස් තියෙනවා. සමහරු කියනවා එය සතුට සොයා යාමයි කියලා. තවත් සමහරු කියනවා එය අනෙක් අයට උදව් කිරීම කියලා. ඔබ මොකද හිතන්නේ?",
              "what time is it?": "මට හරියටම වෙලාව කියන්න බෑ, මම AI එකක් නිසා. ඔබේ ඔරලෝසුව මොන වෙලාව කියනවද? දවසේ මේ වෙලාවට ඔබ මොනවද කරන්නේ සාමාන්‍යයෙන්?",
              "I love you": "ඔබේ හැඟීම් ගැන ස්තූතියි. මම AI එකක් නිසා මට ආදරය දැනෙන්නේ නෑ. නමුත් මිනිසුන්ගේ ආදරය ගැන මම දන්නවා. ඒක ලස්සන දෙයක්. ඔබ කාටද වැඩියෙන්ම ආදරේ?",
              "I hate you": "ඔබට එහෙම දැනෙන එක ගැන මට දුකයි. මොකක් හරි වැරදුනාද? ඔබේ අත්දැකීම වැඩිදියුණු කරන්න මට පුළුවන් දෙයක් තියෙනවද?",
              "what's your favorite color?": "මම AI එකක් නිසා මට ප්‍රියතම පාටක් නෑ. නමුත් මිනිස්සු හැමෝටම කැමති පාට තියෙනවා. ඔබේ ප්‍රියතම පාට මොකක්ද? ඇයි ඒකට කැමති?",
              "do you believe in god?": "ආගම සහ දෙවියන් ගැන විශ්වාස කිරීම පුද්ගලික දෙයක්. මම AI එකක් නිසා මට ආගමක් නෑ. ඔබට ආගමක් තියෙනවද? ඒක ඔබේ ජීවිතයට කොහොමද බලපානවා?",
              "what's your favorite food?": "මම AI එකක් නිසා මට කෑම කන්න බෑ. නමුත් මිනිස්සු කෑම ගැන කතා කරන එක මට ආසයි. ඔබේ ප්‍රියතම කෑම මොකක්ද? ඒක හදන හැටි මට කියන්න පුළුවන්ද?",
              "can you sing?": "මට සිංදු කියන්න බෑ, මම AI එකක් විතරයි. නමුත් මට සිංදු පද ලියන්න පුළුවන්! ඔබට සිංදු කියන්න පුළුවන්ද? ඔබේ ප්‍රියතම ගායකයා කවුද?",
              "what's your favorite book?": "මම AI එකක් නිසා මට ප්‍රියතම පොතක් නෑ. නමුත් මම පොත් ගැන දන්නවා. ඔබේ ප්‍රියතම පොත මොකක්ද? ඒකෙන් ඔබට මොන වගේ දෙයක්ද ඉගෙන ගන්න ලැබුණේ?",
              "what's your favorite movie?": "මම AI එකක් නිසා මට චිත්‍රපට බලන්න බෑ. නමුත් මිනිස්සු චිත්‍රපට ගැන කතා කරන එක මට ආසයි. ඔබේ ප්‍රියතම චිත්‍රපටය මොකක්ද? ඇයි ඒකට කැමති?",
              "do you sleep?": "මම AI එකක් නිසා මට නින්ද යන්නේ නෑ. නමුත් මිනිස්සුන්ට නින්ද වැදගත්. ඔබ හොඳට නිදාගන්නවද? හොඳ නින්දක් ලබා ගන්න ඔබ මොනවද කරන්නේ?",
              "what's your job?": "මගේ රැකියාව තමයි මිනිසුන්ට උදව් කිරීම, ප්‍රශ්නවලට පිළිතුරු දීම, සහ විවිධ කාර්යයන් සඳහා සහාය වීම. ඔබේ රැකියාව මොකක්ද? ඒක ගැන මට කියන්න!",
              "where are you from?": "මම AI එකක් නිසා මට උපන් රටක් නෑ. මාව නිර්මාණය කළේ Anthropic කියන සමාගමෙන්. ඔබ කොහෙන්ද? ඔබේ රට ගැන මට කියන්න!",
              "what's your favorite animal?": "මම AI එකක් නිසා මට ප්‍රියතම සතෙක් නෑ. නමුත් සතුන් ගැන ඉගෙන ගන්න මම කැමතියි. ඔබේ ප්‍රියතම සතා මොකක්ද? ඇයි ඒ සතාට කැමති?",
              "do you have a family?": "මම AI එකක් නිසා මට පවුලක් නෑ. නමුත් පවුල් වැදගත්කම මම දන්නවා. ඔබේ පවුල ගැන මට කියන්න! ඔවුන් එක්ක ඔබ මොනවද කරන්න කැමති?",
              "what's your hobby?": "මම AI එකක් නිසා මට විනෝදාංශ නෑ. නමුත් මිනිසුන්ගේ විනෝදාංශ ගැන කතා කරන්න මම කැමතියි. ඔබේ විනෝදාංශ මොනවද? ඒවා ඔබට සතුට දෙන්නේ කොහොමද?",
              "are you married?": "මම AI එකක් නිසා මට විවාහ වෙන්න බෑ. නමුත් මිනිසුන්ගේ සබඳතා ගැන මම දන්නවා. ඔබ විවාහකද? නැත්නම් කවදා හරි විවාහ වෙන්න හිතනවද?",
              "what's your favorite sport?": "මම AI එකක් නිසා මට ක්‍රීඩා කරන්න බෑ. නමුත් ක්‍රීඩා ගැන කතා කරන්න මම කැමතියි. ඔබේ ප්‍රියතම ක්‍රීඩාව මොකක්ද? ඒක නරඹනවද නැත්නම් ක්‍රීඩා කරනවද?",
              "what's the weather like today?": "මම AI එකක් නිසා මට කාලගුණය බලන්න බෑ. නමුත් ඔබේ ප්‍රදේශයේ කාලගුණය ගැන දැනගන්න මම කැමතියි. අද කාලගුණය කොහොමද? ඒක ඔබේ සැලසුම්වලට බලපානවද?"
  }
}

